import {Intervals} from "../app/entities/ui/MainContainer";

export const mockIntervals: Intervals[] = [
    {
        id: 1,
        intervalStart: 1724,
        intervalEnd: 1955,
        title: 'Наука',
        importantDate: [
            {
                id: 1,
                date: 1724,
                info: 'Основана Академия наук в России'
            },
            {
                id: 2,
                date: 1761,
                info: 'Михаил Ломоносов обнаружил атмосферу планеты Венера'
            },
            {
                id: 3,
                date: 1869,
                info: 'На заседании сделано сообщение об открытии соотношения между свойствами элементов и их атомными весами'
            },
            {
                id: 4,
                date: 1919,
                info: 'В разгар гражданской войны по инициативе Академии Наук создаётся Государственный гидрологический институт'
            },
            {
                id: 5,
                date: 1929,
                info: 'Советский авиаконструктор Николай Ильич Камов даёт созданному им летательному аппарату название «вертолёт»'
            },
            {
                id: 6,
                date: 1955,
                info: 'Состоялся первый полёт ТУ-104'
            },
        ]
    },
    {
        id: 2,
        title: 'Кино',
        intervalStart: 1999,
        intervalEnd: 2020,
        importantDate: [
            {
                id: 1,
                date: 1999,
                info: 'Бойцовский клуб'
            },
            {
                id: 2,
                date: 2004,
                info: 'Авиатор'
            },
            {
                id: 3,
                date: 2006,
                info: 'Казино рояль'
            },
            {
                id: 4,
                date: 2008,
                info: 'Сумерки'
            },
            {
                id: 5,
                date: 2010,
                info: 'Начало'
            },
            {
                id: 6,
                date: 2020,
                info: 'Довод'
            },
        ]
    },
    {
        id: 3,
        title: 'Музыка',
        intervalStart: 1924,
        intervalEnd: 1952,
        importantDate: [
            {
                id: 1,
                date: 1924,
                info: 'Первое всемирно известное американское сочинение'
            },
            {
                id: 2,
                date: 1927,
                info: 'Начало эры звукового кино'
            },
            {
                id: 3,
                date: 1931,
                info: 'Появление ансамблей ударных инструментов'
            },
            {
                id: 4,
                date: 1938 ,
                info: 'Мировой музыкальный центр перемещается в США'
            },
            {
                id: 5,
                date: 1946 ,
                info: 'Начало послевоенного авангарда'
            },
            {
                id: 6,
                date: 1952,
                info: 'Джон Кейдж подводит черту под всей предыдущей музыкальной традицией'
            },
        ]
    },
    {
        id: 4,
        title: 'Технологии',
        intervalStart: 1981,
        intervalEnd: 2002,
        importantDate: [
            {
                id: 1,
                date: 1981,
                info: 'Разработка сканирующего туннельного микроскопа'
            },
            {
                id: 2,
                date: 1989,
                info: 'Создание Всемирной паутины и HTML'
            },
            {
                id: 3,
                date: 1990,
                info: 'Выпуск первой коммерческой версии Photoshop'
            },
            {
                id: 4,
                date: 1991,
                info: 'Выпуск операционной системы Linux'
            },
            {
                id: 5,
                date: 2001,
                info: 'Создание Википедии'
            },
            {
                id: 6,
                date: 2002,
                info: 'Запуск Bluetooth'
            },
        ]
    },
    {
        id: 5,
        title: 'Образование',
        intervalStart: 1911,
        intervalEnd: 2013,
        importantDate: [
            {
                id: 1,
                date: 1911,
                info: 'Реформы П. А. Столыпина'
            },
            {
                id: 2,
                date: 1929,
                info: 'Единая трудовая школа'
            },
            {
                id: 3,
                date: 1934,
                info: 'Разгром педагогии'
            },
            {
                id: 4,
                date: 1960,
                info: 'Обязательная одиннадцатилетка'
            },
            {
                id: 5,
                date: 2003,
                info: 'Присоединение к Болонскому процессу'
            },
            {
                id: 6,
                date: 2013,
                info: 'Перевод школ и вузов на нормативное подушевое финансирование'
            },
        ]
    },
    {
        id: 6,
        title: 'Медицина',
        intervalStart: 2002,
        intervalEnd: 2010,
        importantDate: [
            {
                id: 1,
                date: 2002,
                info: 'Создана искусственная сетчатка глаза.'
            },
            {
                id: 2,
                date: 2003,
                info: 'Сотрудник международной организации «Врачи без границ» Карло Урбани предупредил ВОЗ об угрозе вируса атипичной пневмонии.'
            },
            {
                id: 3,
                date: 2004,
                info: 'Жан-Мишель Дюбернар произвёл первую частичную трансплантацию лица.'
            },
            {
                id: 4,
                date: 2005,
                info: 'Получена первая вакцина против вируса папилломы человека.'
            },
            {
                id: 5,
                date: 2006,
                info: ' Разработана вторая вакцина против ротавирусной инфекции (первая была отменена).'
            },
            {
                id: 6,
                date: 2010,
                info: 'Лоран Лантьери произвёл первую полную трансплантацию лица.'
            },
        ]
    }
]